cask_args appdir: '/Applications'

tap "caskroom/cask"
tap "caskroom/versions"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/dupes"
tap "laurent22/massren"
tap "neovim/neovim"
tap "rogual/neovim-dot-app"

# Install more recent versions of some OS X tools.
brew "grep"
brew "openssh"
brew "vim", args: ["with-override-system-vi"]

brew "aria2"
brew "autoconf"
brew "automake"
brew "awscli"
# Install Bash 4.  Note: don’t forget to add `/usr/local/bin/bash` to
# `/etc/shells` before running `chsh`.
brew "bash"
brew "bash-completion"
brew "boost"
brew "cmake"
# Install GNU core utilities (those that come with OS X are outdated).
# Don’t forget to add `$(brew --prefix coreutils)/libexec/gnubin` to `$PATH`.
brew "coreutils"
brew "cscope"
brew "libassuan"
brew "libksba"
brew "pth"
brew "dirmngr"
brew "dos2unix"
brew "faad2"
brew "fasd"
brew "lame"
brew "git"
brew "xvid"
brew "ffmpeg"
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, `g`-prefixed.
brew "findutils"
brew "fish"
brew "fsevents-tools"
brew "fzf"
brew "jpeg"
brew "gdbm"
brew "gettext"
brew "gmp"
# Install GNU `sed`, overwriting the built-in `sed`.
brew "gnu-sed", args: ["with-default-names"]
brew "nettle"
brew "gnupg"
brew "lua"
brew "gnuplot"
brew "gpg-agent"
brew "openssl"
brew "grc"
brew "highlight"
brew "hping"
brew "httpie"
brew "hub"
brew "libtool"
brew "imagemagick"
brew "oniguruma"
brew "jq"
brew "json-c"
brew "libao"
brew "libevent"
brew "libusb-compat"
brew "python"
# use `brew install macvim` because `brew cask install macvim` has issues in yosemite per http://awebfactory.com/node/541 
brew "macvim"
brew "mad"
brew "mas"
brew "mobile-shell"
brew "msgpack"
brew "mtr"
brew "neovim"
brew "node"
brew "p7zip"
brew "pandoc"
brew "pianobar"
brew "pipes-sh"
brew "pkg-config"
brew "pv"
# for fish support per https://coderwall.com/p/hmousw/using-rbenv-with-fish-the-right-way
brew "ruby-build"
brew "rbenv", args: ["HEAD"]
# For pbcopy support in tmux per http://superuser.com/a/413233
brew "reattach-to-user-namespace", args: ["wrap-pbcopy-and-pbpaste"]
brew "rename"
brew "rhino"
brew "ripgrep"
brew "scons"
brew "speedtest-cli"
brew "tmux"
brew "trash"
brew "tree"
brew "ttyrec"
brew "ttygif"
# Install some CTF tools; see https://github.com/ctfs/write-ups.
brew "ucspi-tcp"
brew "utf8proc"
brew "watch"
brew "zsh"
brew "laurent22/massren/massren"
brew "rogual/neovim-dot-app/neovim-dot-app"
cask "1password"
cask "alfred"
cask "amazon-workdocs"
cask "amazon-workspaces"
cask "appcleaner"
cask "awareness"
cask "bartender"
cask "betterzipql"
cask "bitbar"
cask "cord"
cask "crashplan"
cask "cyberduck"
cask "discord"
cask "disk-inventory-x"
cask "duet"
cask "fantastical"
cask "flux"
cask "google-chrome"
cask "google-hangouts"
cask "hazel"
cask "hyper"
cask "iterm2"
cask "keyboard-cleaner"
cask "lastpass"
cask "launchcontrol"
cask "league-of-legends"
cask "licecap"
cask "lightpaper"
cask "limechat"
cask "liteicon"
cask "macdown"
cask "messenger-for-desktop"
cask "moom"
cask "nomachine"
cask "nvalt"
cask "osxfuse"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "shiftit"
cask "skype"
cask "slimbatterymonitor"
cask "spotify"
cask "sublime-text"
cask "suspicious-package"
cask "trim-enabler"
cask "vagrant"
cask "veracrypt"
cask "voicemac"
cask "xmarks-safari"
mas "1Keyboard", id: 766939888
mas "Evernote", id: 406056744
mas "Growl", id: 467939042
mas "Helium", id: 1054607607
mas "MindMaple Lite", id: 770293173
mas "Pixelmator", id: 407963104
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Soulver", id: 413965349
mas "System Lens", id: 484868989
mas "Telegram", id: 747648890
mas "Xcode", id: 497799835
